
![film crew](film_crew_icon.jpg)

# MOVIE ANALYSIS FOR MICROSOFT CORPORATION


## Final Project Submission 

* Student name: Evaclaire Munyika
* Student pace: Full time - Remote
* Scheduled project review date/time: 22nd March, 2024
* Instructor name: Asha Deen / Lucille Kaleha

## Overview

This project was aimed at helping Microsoft break into the movie industry by obtaining much needed insight into what makes for a great movie. I looked into a wide variety of films produced over the years to see what makes some perform better than others.

From my analysis, the following were the greatest determiners of a movie's success:

* Genre: Different genres appeal to different audiences and certain genres tend to perform better at the box office than others. Genres such as action, adventure, fantasy, and superhero movies tend to have a wider appeal and thus generate more box office revenue.

* Release Timing: The time of year a movie is released directly impacts its box office performance. Movies released during peak seasons or strategically timed to coincide with holidays or special events tend to perform better.

* Budget: The effectiveness of a movie's production, marketing and promotional campaigns significantly influence its box office success. A larger budget enables the best production methods and teams and wider promotion tours for a movie leading to higher ticket sales.

## Business Understanding

Microsoft is a multinational technology company headquatered in Redmond, Washington,USA. They are well known for their software products and services and are now looking to dive into the movie making scene and compete against industry heavy hitters. Microsoft decided to create a new movie studio but they lacked proper insight as to what makes great movies,GREAT! The goal was to analyse some of the most successful box office movies and advice the head of Microsoft's new movie studio on what they need inorder to produce successful films.

## Data Understanding

The following were my sources of data for this project:

* ImDb movie database - This is an SQLite database that contained two tables relevant to our analysis. The first table is the movie basic table that contains movie id, original and primary movie title, start year, genre, runtime in minutes. The second table is called movie rating and it contains the movie id, average rating and number of votes a movie garnered.

* Box office mojo (BOM) - This dataset contains the movie name, domestic and foreign gross, year and the studio that produced the movie.

*

## Data Preparation

I began by importing the modules I would require for the entirety of this project.

In [1]:
# importing the necessary modules to carry out the project
import pandas as pd
# configuring pandas to display floating point numbers 
# to 2 decimal places
pd.options.display.float_format = '{:.2f}'.format
import sqlite3
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

### International Movie Database (IMDB)

I began by assessing the data contained in the movie basics table in the imdb database using SQLite3.

In [2]:
# declaring the path to the database
database_path = r'/Users/claire/Desktop/DS-FT08/Project files/im.db'
# connecting to the database
conn = sqlite3.connect(database_path)
# querying the database to view the movie basics table
q = '''
SELECT *
FROM movie_basics;
'''
movie_basics_df = pd.read_sql(q, conn)
# closing the database connection
conn.close()
# previewing the dataframe
movie_basics_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.00,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.00,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.00,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,nan,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.00,"Comedy,Drama,Fantasy"

In [3]:
# assessing information about the dataframe 
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

I could see I had some missing values in the original_title column, the start_year column, runtime_minutes and genres column. My major focus was on the genres, runtime minutes and start year column so I went ahead to see what they contained.

In [4]:
# assessing the value counts of the top 10 genres
movie_basics_df['genres'].value_counts().head(10)

Documentary              32185
Drama                    21486
Comedy                    9177
Horror                    4372
Comedy,Drama              3519
Thriller                  3046
Action                    2219
Biography,Documentary     2115
Drama,Romance             2079
Comedy,Drama,Romance      1558
Name: genres, dtype: int64

In [5]:
# getting descriptive statistics of the runtime minutes column
movie_basics_df['runtime_minutes'].describe()

count   114405.00
mean        86.19
std        166.36
min          1.00
25%         70.00
50%         87.00
75%         99.00
max      51420.00
Name: runtime_minutes, dtype: float64

Now to view the contents of the movie ratings dataframe.

In [6]:
# declaring the path to the database
database_path = r'/Users/claire/Desktop/DS-FT08/Project files/im.db'
# connecting to the database
conn = sqlite3.connect(database_path)
# querying the database to view the movie ratings table
q = '''
SELECT *
FROM movie_ratings;
'''
movie_ratings_df = pd.read_sql(q, conn)
# closing the database connection
conn.close()
# previewing the dataframe
movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526           8.30        31
1  tt10384606           8.90       559
2   tt1042974           6.40        20
3   tt1043726           4.20     50352
4   tt1060240           6.50        21

In [7]:
# assessing information about the dataframe
movie_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

Luckily there were no missing values so I went on to get descriptive statistics of the average rating column and the numvotes column to get a feel of the data.

In [8]:
# getting descriptive statistics of average movie ratings
movie_ratings_df['averagerating'].describe()

count   73856.00
mean        6.33
std         1.47
min         1.00
25%         5.50
50%         6.50
75%         7.40
max        10.00
Name: averagerating, dtype: float64

In [9]:
# getting descriptive statistics of numvotes
movie_ratings_df['numvotes'].describe()

count     73856.00
mean       3523.66
std       30294.02
min           5.00
25%          14.00
50%          49.00
75%         282.00
max     1841066.00
Name: numvotes, dtype: float64

### Merging

I saw that the numvotes column contained some outliers which I would have to deal with along the way. At this point I thought it best to merge the two tables from the imdb database in order to assign the average ratings to specific movies.

In [10]:
# merging the movie basics dataframe and the movie ratings dataframe to
# link movie titles and genres and their respective rating
imdb_merged_df = pd.merge(movie_basics_df, movie_ratings_df, how = 'outer')
# previewing the top 5 results
imdb_merged_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.00,"Action,Crime,Drama",7.00,77.00
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.00,"Biography,Drama",7.20,43.00
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.00,Drama,6.90,4517.00
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,nan,"Comedy,Drama",6.10,13.00
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.00,"Comedy,Drama,Fantasy",6.50,119.00

In [11]:
# assessing dataframe info
imdb_merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146144 entries, 0 to 146143
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
 6   averagerating    73856 non-null   float64
 7   numvotes         73856 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 10.0+ MB

### Data cleaning

I decided to deal with duplicate values with the same primary title, genre and start year so as to make the data less murky.

In [12]:
# looking for duplicate values in relation to the primary title, start year and genres
imdb_merged_df.loc[imdb_merged_df.duplicated(subset = ['primary_title', 'start_year', 'genres'])]

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
948,tt10064536,Untitled Disney Marvel Film,Untitled Disney Marvel Film,2022,nan,Action,nan,nan
949,tt10064558,Untitled Marvel Film,Untitled Marvel Film,2021,nan,Action,nan,nan
1478,tt10127292,Plushtubers: The Apocalypse,Plushtubers: The Apocalypse,2019,nan,"Action,Adventure",nan,nan
2231,tt10224422,Olanda,Olanda,2019,154.00,Documentary,nan,nan
2286,tt10230042,Rok Sako To Rok Lo,Rok Sako To Rok Lo,2018,nan,Comedy,nan,nan
...,...,...,...,...,...,...,...,...
145222,tt9786006,Waiting for the Carnival,Waiting for the Carnival,2019,76.00,Documentary,nan,nan
145459,tt9819724,The Tale of Two Deaf Travellers,The Tale of Two Deaf Travellers,2018,5.00,"Adventure,Biography,Documentary",nan,nan
145559,tt9838402,Furie,Furie,2019,nan,Action,nan,nan
145903,tt9883728,"Congo, My Precious","Congo, My Precious",2017,nan,Documentary,nan,nan
145937,tt9889072,The Promise,The Promise,2017,nan,Drama,nan,nan

In [13]:
# confirming duplicates have same start year, primary titles and genres
imdb_merged_df.loc[imdb_merged_df['primary_title'] == 'Olanda']

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
2001,tt10195890,Olanda,Olanda,2019,154.00,Documentary,nan,nan
2231,tt10224422,Olanda,Olanda,2019,154.00,Documentary,nan,nan

In [14]:
# confirming duplicates have same start year, primary titles and genres
imdb_merged_df.loc[imdb_merged_df['primary_title'] == 'Furie']

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
142723,tt9412268,Furie,Hai Phuong,2019,98.00,Action,6.70,1188.00
145559,tt9838402,Furie,Furie,2019,nan,Action,nan,nan

Since the main aim was to retain only entries with genre values, I decided to drop duplicates with null values.

In [15]:
# dropping duplicate values
imdb_merged_df.drop_duplicates(subset=['primary_title', 'start_year', 'genres'], inplace=True)

In [16]:
# checking on the status of the remaining columns
imdb_merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 145789 entries, 0 to 146143
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         145789 non-null  object
 1   primary_title    145789 non-null  object
 2   original_title   145768 non-null  object
 3   start_year       145789 non-null  int64
 4   runtime_minutes  114145 non-null  float64
 5   genres           140398 non-null  object
 6   averagerating    73771 non-null   float64
 7   numvotes         73771 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 10.0+ MB

Now was the time to get rid of unwanted columns to zero in on the target data. I opted to drop the numvotes,start_year,original_title, movie_id columns and runtime_minutes as they would not be relevant to my analysis targets.

In [17]:
# declaring columns to drop in a list
to_drop = ['numvotes', 'start_year', 'original_title', 'movie_id', 'runtime_minutes']
# dropping listed columns
imdb_merged_df.drop(columns = to_drop, axis=1, inplace=True)

In [18]:
# previewing dataframe columns
imdb_merged_df.columns

Index(['primary_title', 'genres', 'averagerating'], dtype='object')

In [19]:
# renaming the averagerating column to rating 
imdb_merged_df = imdb_merged_df.rename(columns = {'averagerating': 'rating','primary_title': 'title'}) 
# previewing first 5 results
imdb_merged_df.head()

                             title                genres  rating
0                        Sunghursh    Action,Crime,Drama    7.00
1  One Day Before the Rainy Season       Biography,Drama    7.20
2       The Other Side of the Wind                 Drama    6.90
3                  Sabse Bada Sukh          Comedy,Drama    6.10
4         The Wandering Soap Opera  Comedy,Drama,Fantasy    6.50

The next step was to eliminate null values in the rating and genres columns as these would affect our analysis.

In [20]:
# checking for null values in order to remove them
imdb_merged_df.isna().sum()

title         0
genres     5391
rating    72018
dtype: int64

In [21]:
# dropping rows containing null values
imdb_merged_df.dropna(subset=['genres', 'rating'], inplace=True)

In [22]:
# confirming our data is now free of null values
imdb_merged_df.isna().sum()

title     0
genres    0
rating    0
dtype: int64

In [23]:
#final check of the dataframe columns to confirm no missing values
imdb_merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 72967 entries, 0 to 146134
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   72967 non-null  object
 1   genres  72967 non-null  object
 2   rating  72967 non-null  float64
dtypes: float64(1), object(2)
memory usage: 2.2+ MB

### Box Office Mojo (BOM)

I decided to look into the Box Office Mojo (bom) movie gross dataset to see what additional insights I would gain.

In [24]:
# declaring the file path
file_path = r'/Users/claire/Desktop/DS-FT08/Project files/bom.movie_gross.csv'
# reading the csv file into a dataframe
bom_movie_gross_df = pd.read_csv(file_path)
# displaying first five results
bom_movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.00,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.00,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.00,664300000,2010
3,Inception,WB,292600000.00,535700000,2010
4,Shrek Forever After,P/DW,238700000.00,513900000,2010

In [25]:
# getting information about the dataframe
bom_movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [26]:
# investigating the years the data spans
bom_movie_gross_df['year'].value_counts()

2015    450
2016    436
2012    400
2011    399
2014    395
2013    350
2010    328
2017    321
2018    308
Name: year, dtype: int64

In [27]:
# getting descriptive statistics of the domestic gross column
bom_movie_gross_df['domestic_gross'].describe()

count        3359.00
mean     28745845.07
std      66982498.24
min           100.00
25%        120000.00
50%       1400000.00
75%      27900000.00
max     936700000.00
Name: domestic_gross, dtype: float64

In [28]:
# getting descriptive statistics of the foreign gross column
bom_movie_gross_df['foreign_gross'].describe()

count        2037
unique       1204
top       1200000
freq           23
Name: foreign_gross, dtype: object

### Data cleaning

Upon realizing that data in the foreign gross column was of the type object, I got to changing its format to float64 after stripping any unneccesary commas present in some of the values.

In [29]:
# converting data type from object to float64
bom_movie_gross_df['foreign_gross'] = bom_movie_gross_df['foreign_gross'].str.replace(',', '').astype(float)

In [30]:
# confirming data type has changed to float64
bom_movie_gross_df.dtypes

title              object
studio             object
domestic_gross    float64
foreign_gross     float64
year                int64
dtype: object

In [31]:
# getting descriptive statistics of the foreign gross column
bom_movie_gross_df['foreign_gross'].describe()

count        2037.00
mean     74872810.15
std     137410600.84
min           600.00
25%       3700000.00
50%      18700000.00
75%      74900000.00
max     960500000.00
Name: foreign_gross, dtype: float64

I decided to do away with the studio column and rename the year column to release_year

In [32]:
# dropping the studio column
bom_movie_gross_df.drop('studio' ,axis=1, inplace=True)
# previewing first five results of the dataframe
bom_movie_gross_df.head()

,title,domestic_gross,foreign_gross,year
0,Toy Story 3,415000000.00,652000000.00,2010
1,Alice in Wonderland (2010),334200000.00,691300000.00,2010
2,Harry Potter and the Deathly Hallows Part 1,296000000.00,664300000.00,2010
3,Inception,292600000.00,535700000.00,2010
4,Shrek Forever After,238700000.00,513900000.00,2010

In [33]:
# renaming the year column to release_year
bom_movie_gross_df = bom_movie_gross_df.rename(columns = {'year': 'release_year'}) 
# previewing column names
bom_movie_gross_df.columns

Index(['title', 'domestic_gross', 'foreign_gross', 'release_year'], dtype='object')

In [34]:
#picking only films produced after 2015
bom_movie_gross_df = bom_movie_gross_df[(bom_movie_gross_df['release_year']>=2015)]

In [35]:
# previewing first 5 results
bom_movie_gross_df.head()

,title,domestic_gross,foreign_gross,release_year
1872,Star Wars: The Force Awakens,936700000.00,1131.60,2015
1873,Jurassic World,652300000.00,1019.40,2015
1874,Furious 7,353000000.00,1163.00,2015
1875,Avengers: Age of Ultron,459000000.00,946400000.00,2015
1876,Minions,336000000.00,823400000.00,2015

### The movie database (TMDb) data

In [36]:
# declaring the file path
file_path = r'/Users/claire/Desktop/DS-FT08/Project files/tmdb.movies.csv'
# reading the csv file into a dataframe
tmdb_df = pd.read_csv(file_path)
# displaying first five results
tmdb_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.53,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.70,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.73,2010-03-26,How to Train Your Dragon,7.70,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.52,2010-05-07,Iron Man 2,6.80,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.00,1995-11-22,Toy Story,7.90,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.92,2010-07-16,Inception,8.30,22186

In [37]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

I was pleased to see that this dataset contained no missing values.This would make the normalization process a bit breezy. I proceeded to drop unwanted columns such as unnamed:0, id, genre_ids,original_language, popularity and vote count.

In [38]:
to_drop = ['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title', 'popularity', 'vote_count']
tmdb_df.drop(columns = to_drop, axis=1, inplace=True)
tmdb_df.head()

  release_date                                         title  vote_average
0   2010-11-19  Harry Potter and the Deathly Hallows: Part 1          7.70
1   2010-03-26                      How to Train Your Dragon          7.70
2   2010-05-07                                    Iron Man 2          6.80
3   1995-11-22                                     Toy Story          7.90
4   2010-07-16                                     Inception          8.30

Next was to convert the release date from object to datetime format so as to retrieve the release months and release years of the movies because I noted that some entries dated as far back as the 1930s and I wanted to work with data from 2010 onwards.

In [39]:
# converting release date to datetime format
tmdb_df['release_date'] = pd.to_datetime(tmdb_df['release_date'])
# creating new column for the release month
tmdb_df['release_month'] = tmdb_df['release_date'].dt.strftime('%B')
# creating new column for release years
tmdb_df['release_year'] = tmdb_df['release_date'].dt.strftime('%Y')
# creating new column for release day
tmdb_df['release_day'] = tmdb_df['release_date'].dt.day_name()
# analysing the value counts of release months
tmdb_df['release_month'].value_counts()

January      3132
October      3035
April        2566
March        2406
November     2338
September    2264
June         2166
December     1929
May          1865
August       1698
February     1614
July         1504
Name: release_month, dtype: int64

In [40]:
# getting count of itms in release year column
tmdb_df['release_year'].value_counts()

2015    3258
2016    3192
2013    3147
2017    3145
2014    3137
        ...
1976       1
1946       1
1936       1
1966       1
1965       1
Name: release_year, Length: 66, dtype: int64

In [41]:
# checking the data type of the release year column
tmdb_df['release_year'].dtype

dtype('O')

After realizing that the release year data was an object, I took to converting it to an integer to make the analysis easier.

In [42]:
# converting release years to integers
tmdb_df['release_year'] = tmdb_df['release_year'].astype(int)
# confirming data type conversion
tmdb_df['release_year'].dtype

dtype('int64')

In [43]:
# Getting rid of all rows with release years before 2010
tmdb_df = tmdb_df[(tmdb_df['release_year']>=2015)]
# previewing the release year values
tmdb_df['release_year'].value_counts()

2015    3258
2016    3192
2017    3145
2018    2587
2019      63
2020       1
Name: release_year, dtype: int64

Awesome! Now to get a preview of the dataframe after all the changes made.

In [44]:
# previewing the first five results
tmdb_df.head()

,release_date,title,vote_average,release_month,release_year,release_day
3217,2015-09-25,Mission to Lars,6.30,September,2015,Friday
4535,2017-03-15,Inside The Mob's Bloody Valentine,8.00,March,2017,Wednesday
5030,2016-11-10,"Silent Night, Dead Night: A New Christmas Carol",4.00,November,2016,Thursday
5316,2016-08-08,Rurouni Kenshin,7.40,August,2016,Monday
8138,2015-08-14,Tom at the Farm,7.00,August,2015,Friday

In [45]:
# checking for null values in the dataframe
tmdb_df.isna().sum()

release_date     0
title            0
vote_average     0
release_month    0
release_year     0
release_day      0
dtype: int64

Now that I was sure there were no null values in the dataset,my aim was to eliminate duplicates with relation to the title of the movie.

In [46]:
# checking for duplicates
tmdb_df.loc[tmdb_df.duplicated(subset = ['title'])]

,release_date,title,vote_average,release_month,release_year,release_day
14181,2015-02-13,Kingsman: The Secret Service,7.60,February,2015,Friday
14212,2015-03-27,It Follows,6.50,March,2015,Friday
14246,2015-01-09,Inherent Vice,6.60,January,2015,Friday
14290,2015-02-13,What We Do in the Shadows,7.60,February,2015,Friday
14293,2015-08-21,Some Kind of Beautiful,5.70,August,2015,Friday
...,...,...,...,...,...,...
26487,2018-01-02,Parched,3.00,January,2018,Tuesday
26504,2015-03-28,Head,1.00,March,2015,Saturday
26506,2018-11-25,Eden,0.00,November,2018,Sunday
26510,2018-10-19,Fail State,0.00,October,2018,Friday
26511,2018-04-07,Making Filmmakers,0.00,April,2018,Saturday

In [47]:
tmdb_df.loc[tmdb_df['title'] == 'Hush']

      release_date title  vote_average release_month  release_year release_day
16943   2015-03-27  Hush          6.00         March          2015      Friday
17499   2016-03-12  Hush          6.80         March          2016    Saturday

In [48]:
tmdb_df.loc[tmdb_df['title'] == 'The Boy']

,release_date,title,vote_average,release_month,release_year,release_day
14537,2015-08-14,The Boy,5.60,August,2015,Friday
17517,2016-01-22,The Boy,5.80,January,2016,Friday

In [49]:
tmdb_df.loc[tmdb_df['title'] == 'Flowers']

,release_date,title,vote_average,release_month,release_year,release_day
15095,2015-10-30,Flowers,6.90,October,2015,Friday
15848,2015-02-01,Flowers,4.70,February,2015,Sunday
26396,2018-08-08,Flowers,6.00,August,2018,Wednesday

A major issue arose as some movie titles had more than 2 duplicates with varying release months and release years. I decided to drop the duplicates for the sake of uniformity.

In [50]:
# dropping duplicate values based on the same title, release month and release year
tmdb_df.drop_duplicates(subset=['title'], inplace=True)

Then I confirmed whether the dataframe contained any duplicates based on title.

In [51]:
# confirming new dataframe does not contain any duplicates as per movie title
tmdb_df.loc[tmdb_df.duplicated(subset = ['title'])]

Empty DataFrame
Columns: [release_date, title, vote_average, release_month, release_year, release_day]
Index: []

In [52]:
# checking that each title appears once
tmdb_df['title'].value_counts()

Manifest: The Chryzinium Era                          1
Filmworker                                            1
Always at The Carlyle                                 1
Always                                                1
Sweethearts of the Gridiron                           1
                                                     ..
Hostiles                                              1
The Boss Baby and Tim's Treasure Hunt Through Time    1
Rhonda Rides to Hell                                  1
Pan                                                   1
Soul Mate                                             1
Name: title, Length: 11319, dtype: int64

In [53]:
# renaming the column vote_average to rating
tmdb_df = tmdb_df.rename(columns = {'vote_average': 'rating'}) 
# previewing column names
tmdb_df.columns

Index(['release_date', 'title', 'rating', 'release_month', 'release_year',
       'release_day'],
      dtype='object')

Having confirmed that there were no duplicates and null values, I proceeded to analyse the final dataset that would aid in my decision making.

### Movie budgets dataset

This dataset contained data on the production budget of different movies and how much they grossed domestically and worldwide after the release date. Below is how I went about exploring and cleaning the data.

In [54]:
# declaring the file path
file_path = r'/Users/claire/Desktop/DS-FT08/Project files/tn.movie_budgets.csv'
# reading the csv file into a dataframe
movie_budgets_df = pd.read_csv(file_path)
# displaying first five results
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [55]:
# assessing the number of rows and columns in the dataframe
movie_budgets_df.shape

(5782, 6)

I was glad to see that the dataset was not missing any values so I decided to dive right into cleaning up the data by configuring the release dates to datetime format and stripping the $ signs and commas from the budget and gross income figures and lastly converting them from objects to integers.

In [56]:
# stripping dollar signs and commas from the production budget column and converting values to integers
movie_budgets_df['production_budget'] = movie_budgets_df['production_budget'].str.replace(',','').str.replace('$','').astype(int)
# stripping dollar signs and commas from the domestic gross column and converting values to integers
movie_budgets_df['domestic_gross'] = movie_budgets_df['domestic_gross'].str.replace(',','').str.replace('$','').astype(int)
# stripping dollar signs and commas from the worldwide gross column and converting values to integers
movie_budgets_df['worldwide_gross'] = movie_budgets_df['worldwide_gross'].str.replace(',','').str.replace('$','').astype(int)
# previewing the dataframe
movie_budgets_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,7000,0,0
5778,79,"Apr 2, 1999",Following,6000,48482,240495
5779,80,"Jul 13, 2005",Return to the Land of Wonders,5000,1338,1338
5780,81,"Sep 29, 2015",A Plague So Pleasant,1400,0,0
5781,82,"Aug 5, 2005",My Date With Drew,1100,181041,181041

I created a new column for gross_profit to see the return on investment in relation to a movie's production budget

In [57]:
# creating a new column for gross profit made
movie_budgets_df['gross_profit'] = (movie_budgets_df['worldwide_gross'] - movie_budgets_df['production_budget'])
# previewing results
movie_budgets_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,gross_profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2351345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,635063875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-200237650
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,1072413963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,999721747
...,...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,7000,0,0,-7000
5778,79,"Apr 2, 1999",Following,6000,48482,240495,234495
5779,80,"Jul 13, 2005",Return to the Land of Wonders,5000,1338,1338,-3662
5780,81,"Sep 29, 2015",A Plague So Pleasant,1400,0,0,-1400
5781,82,"Aug 5, 2005",My Date With Drew,1100,181041,181041,179941

In [58]:
# converting release date to datetime format
movie_budgets_df['release_date'] = pd.to_datetime(movie_budgets_df['release_date'])
# creating new column for the release month
movie_budgets_df['release_month'] = movie_budgets_df['release_date'].dt.strftime('%B')
# creating new column for release years
movie_budgets_df['release_year'] = movie_budgets_df['release_date'].dt.strftime('%Y').astype(int)
# creating new column for release day
movie_budgets_df['release_day'] = movie_budgets_df['release_date'].dt.day_name()
# renaming the movie column to title
movie_budgets_df = movie_budgets_df.rename(columns = {'movie': 'title'}) 
# dropping the id column
movie_budgets_df.drop(columns='id', inplace=True)
# previewing dataframe
movie_budgets_df

,release_date,title,production_budget,domestic_gross,worldwide_gross,gross_profit,release_month,release_year,release_day
0,2009-12-18,Avatar,425000000,760507625,2776345279,2351345279,December,2009,Friday
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,635063875,May,2011,Friday
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-200237650,June,2019,Friday
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,1072413963,May,2015,Friday
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,999721747,December,2017,Friday
...,...,...,...,...,...,...,...,...,...
5777,2018-12-31,Red 11,7000,0,0,-7000,December,2018,Monday
5778,1999-04-02,Following,6000,48482,240495,234495,April,1999,Friday
5779,2005-07-13,Return to the Land of Wonders,5000,1338,1338,-3662,July,2005,Wednesday
5780,2015-09-29,A Plague So Pleasant,1400,0,0,-1400,September,2015,Tuesday
5781,2005-08-05,My Date With Drew,1100,181041,181041,179941,August,2005,Friday

In [59]:
# filtering only films produced after 2015
movie_budgets_df = movie_budgets_df[(movie_budgets_df['release_year']>=2015)]
# previewing the first 10 results
movie_budgets_df.head(10)

,release_date,title,production_budget,domestic_gross,worldwide_gross,gross_profit,release_month,release_year,release_day
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-200237650,June,2019,Friday
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,1072413963,May,2015,Friday
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,999721747,December,2017,Friday
5,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1747311220,December,2015,Friday
6,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,1748134200,April,2018,Friday
8,2017-11-17,Justice League,300000000,229024295,655945209,355945209,November,2017,Friday
9,2015-11-06,Spectre,300000000,200074175,879620923,579620923,November,2015,Friday
11,2018-05-25,Solo: A Star Wars Story,275000000,213767512,393151347,118151347,May,2018,Friday
16,2016-05-06,Captain America: Civil War,250000000,408084349,1140069413,890069413,May,2016,Friday
17,2016-03-25,Batman v Superman: Dawn of Justice,250000000,330360194,867500281,617500281,March,2016,Friday

In [60]:
# checking the final number of rows and columns in the dataframe
movie_budgets_df.shape

(938, 9)

In [61]:
# cofirming there are no null values in the dataframe
movie_budgets_df.isna().sum()

release_date         0
title                0
production_budget    0
domestic_gross       0
worldwide_gross      0
gross_profit         0
release_month        0
release_year         0
release_day          0
dtype: int64

### Merging the dataframes

Now was the time to merge the three datframes systematically inorder to bring together all the different columns with values that would enable us to derive insights for Microsoft. The first step was to merge the dataframes containing financial data about the different movies. I went with a right join inorder to include all rows from the movie_budgets dataframe and matching rows from the box office mojo dataframe in order to fill in any missing values and kind of get the best of both worlds.

In [62]:
# merging the bom_movie_gross dataframe with the movie_budgets dataframe
bom_moviebudgets_df = pd.merge(bom_movie_gross_df, movie_budgets_df, how='right')
# creating a new column for foreign gross values
bom_moviebudgets_df['foreign_gross'] = (bom_moviebudgets_df['worldwide_gross'] - bom_moviebudgets_df['domestic_gross'])
# previewing the top 10 results
bom_moviebudgets_df.head(10)

,title,domestic_gross,foreign_gross,release_year,release_date,production_budget,worldwide_gross,gross_profit,release_month,release_day
0,Dark Phoenix,42762350,107000000,2019,2019-06-07,350000000,149762350,-200237650,June,Friday
1,Avengers: Age of Ultron,459005868,944008095,2015,2015-05-01,330600000,1403013963,1072413963,May,Friday
2,Star Wars Ep. VIII: The Last Jedi,620181382,696540365,2017,2017-12-15,317000000,1316721747,999721747,December,Friday
3,Star Wars Ep. VII: The Force Awakens,936662225,1116648995,2015,2015-12-18,306000000,2053311220,1747311220,December,Friday
4,Avengers: Infinity War,678815482,1369318718,2018,2018-04-27,300000000,2048134200,1748134200,April,Friday
5,Justice League,229024295,426920914,2017,2017-11-17,300000000,655945209,355945209,November,Friday
6,Spectre,200074175,679546748,2015,2015-11-06,300000000,879620923,579620923,November,Friday
7,Solo: A Star Wars Story,213767512,179383835,2018,2018-05-25,275000000,393151347,118151347,May,Friday
8,Captain America: Civil War,408084349,731985064,2016,2016-05-06,250000000,1140069413,890069413,May,Friday
9,Batman v Superman: Dawn of Justice,330360194,537140087,2016,2016-03-25,250000000,867500281,617500281,March,Friday

In [63]:
# sorting the dataframe by gross profit in descending order
bom_moviebudgets_df_sorted = bom_moviebudgets_df.sort_values(by= 'gross_profit', ascending=False)
bom_moviebudgets_df_sorted.head(10)

,title,domestic_gross,foreign_gross,release_year,release_date,production_budget,worldwide_gross,gross_profit,release_month,release_day
4,Avengers: Infinity War,678815482,1369318718,2018,2018-04-27,300000000,2048134200,1748134200,April,Friday
3,Star Wars Ep. VII: The Force Awakens,936662225,1116648995,2015,2015-12-18,306000000,2053311220,1747311220,December,Friday
13,Jurassic World,652270625,996584239,2015,2015-06-12,215000000,1648854864,1433854864,June,Friday
21,Furious 7,353007020,1165715774,2015,2015-04-03,190000000,1518722794,1328722794,April,Friday
14,Black Panther,700059566,648198658,2018,2018-02-16,200000000,1348258224,1148258224,February,Friday
44,Jurassic World: Fallen Kingdom,417719760,888053039,2018,2018-06-22,170000000,1305772799,1135772799,June,Friday
52,Beauty and the Beast,504014165,755185541,2017,2017-03-17,160000000,1259199706,1099199706,March,Friday
155,Minions,336045770,824290403,2015,2015-07-10,74000000,1160336173,1086336173,July,Friday
1,Avengers: Age of Ultron,459005868,944008095,2015,2015-05-01,330600000,1403013963,1072413963,May,Friday
15,Incredibles 2,608581744,633938967,2018,2018-06-15,200000000,1242520711,1042520711,June,Friday

In [64]:
# previewing number of rows and columns in the merged dataset.
bom_moviebudgets_df_sorted.shape

(938, 10)

In [65]:
# checking for any null values
bom_moviebudgets_df_sorted.isna().sum()

title                0
domestic_gross       0
foreign_gross        0
release_year         0
release_date         0
production_budget    0
worldwide_gross      0
gross_profit         0
release_month        0
release_day          0
dtype: int64

Lastly I performed an inner join/ merge on the imdb_merged dataframe and the earlier merged box office mojo and movie_budgets dataframes to link the movie release details and finacials to their respective genres.

In [66]:
# merging the imdb_merged dataframe to the bom_moviebudgets dataframe
imdb_bom_moviebudgets_df = pd.merge(imdb_merged_df, bom_moviebudgets_df, how='inner')
# previewing merged dataframe
imdb_bom_moviebudgets_df.head()

,title,genres,rating,domestic_gross,foreign_gross,release_year,release_date,production_budget,worldwide_gross,gross_profit,release_month,release_day
0,Jurassic World,"Action,Adventure,Sci-Fi",7.00,652270625,996584239,2015,2015-06-12,215000000,1648854864,1433854864,June,Friday
1,Alita: Battle Angel,"Action,Adventure,Sci-Fi",7.50,85710210,317265826,2019,2019-02-14,170000000,402976036,232976036,February,Thursday
2,Before We Go,"Comedy,Drama,Romance",6.80,37151,446787,2015,2015-09-04,3000000,483938,-2516062,September,Friday
3,Before We Go,"Documentary,Drama,News",7.00,37151,446787,2015,2015-09-04,3000000,483938,-2516062,September,Friday
4,The History of Love,"Drama,Romance,War",6.30,0,476624,2016,2016-11-18,20000000,476624,-19523376,November,Friday

In [67]:
# sorting the values in desecnding order by worldwide gross
imdb_bom_moviebudgets_df_sorted = imdb_bom_moviebudgets_df.sort_values(by='worldwide_gross', ascending=False)
# previewing sorted dataframe
imdb_bom_moviebudgets_df_sorted.head()

,title,genres,rating,domestic_gross,foreign_gross,release_year,release_date,production_budget,worldwide_gross,gross_profit,release_month,release_day
788,Avengers: Infinity War,"Action,Adventure,Sci-Fi",8.50,678815482,1369318718,2018,2018-04-27,300000000,2048134200,1748134200,April,Friday
0,Jurassic World,"Action,Adventure,Sci-Fi",7.00,652270625,996584239,2015,2015-06-12,215000000,1648854864,1433854864,June,Friday
577,Furious 7,"Action,Crime,Thriller",7.20,353007020,1165715774,2015,2015-04-03,190000000,1518722794,1328722794,April,Friday
475,Avengers: Age of Ultron,"Action,Adventure,Sci-Fi",7.30,459005868,944008095,2015,2015-05-01,330600000,1403013963,1072413963,May,Friday
255,Black Panther,"Action,Adventure,Sci-Fi",7.30,700059566,648198658,2018,2018-02-16,200000000,1348258224,1148258224,February,Friday

In [68]:
# previewing number of rows and columns in the dataframe
imdb_bom_moviebudgets_df_sorted.shape

(994, 12)

In [70]:
# checking for any null values in the dataframe
imdb_bom_moviebudgets_df_sorted.isna().sum()

title                0
genres               0
rating               0
domestic_gross       0
foreign_gross        0
release_year         0
release_date         0
production_budget    0
worldwide_gross      0
gross_profit         0
release_month        0
release_day          0
dtype: int64

## REFERENCES

<a href="https://www.freepik.com/free-vector/film-crew-movie-production-studio-staff_29314759.htm#fromView=search&page=1&position=8&uuid=1c379553-fabc-44ff-a8ab-f4c3d5519362">Image by upklyak on Freepik</a>